Catalogs/КТРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КТРУ</Name>
			<Comment>Каталог товаров, работ, услуг для обеспечения государственных и муниципальных нужд</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлассификаторОКПД2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Групповой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Классификаторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Классификатор</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДочернийКлассификаторКТРУ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КлассификаторКТРУ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Устанавливает объектную блокировку.
// Вызывает исключение, если объект уже заблокирован.
//
// Параметры:
//  Объект   - любой объект ссылочного типа информационной базы.
//  Включить - Булево - определяет, будет ли включена объектная блокировка.
//
Процедура ЗаблокироватьОбъект(Объект) Экспорт
	
	Попытка
		Объект.Заблокировать();
	Исключение
		
		Текст = НСтр("ru = 'Не удалось заблокировать данные объекта ""%1"".
			|Возможно, объект редактируется другим пользователем.'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Объект.Ссылка);
		ВызватьИсключение Текст;
		
	КонецПопытки;
	
КонецПроцедуры

// Найти создать единицу измерения для КТРУ.
// 
// Параметры:
//  КодЕдиницыИзмерения - Строка - Код единицы измерения
//  НаименованиеЕдиницыИзмерения - Строка - Наименование единицы измерения
// Возвращаемое значение:
//  СправочникСсылка.ЕдиницыИзмерения - единица измерения.
Функция НайтиСоздатьЕдиницуИзмеренияКТРУ(КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения = "") Экспорт
	
	ЕдиницаИзмерения = Неопределено;
	КлассификаторКТРУПереопределяемый.НайтиСоздатьЕдиницуИзмеренияКТРУ(
		КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения, ЕдиницаИзмерения);
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКлассификаторами") Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.КТРУ.ПриДобавленииКлассификаторов(Классификаторы);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКлассификаторами") Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.КТРУ.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан);
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

#КонецОбласти
